export default { 
    integer: /^-?\d*$/,           //整数 
    integerOfpositive: /^\d*$/,   //正整数
    float: /^-?\d*[.,]?\d*$/, 
    floatOfpositive: /^\d*[.,]?\d*$/,      
    currency: /^\d*[.,]?\d{0,2}$/,
    alphabet: /^[a-z]*$/i,      //字母 
    password: /^[^\u4e00-\u9fa5]{5,15}$/, // 5-15位非中文字符 (密码)
    includeChineseCharacter:/[\u4e00-\u9fa5]/,
    //座机号
    landlinePhone:/(^(0[0-9]{2,3}-)?([2-9][0-9]{6,7}|400[0-9]{6,7})(-[0-9]{1,7})?$)|(^(400-)?[2-9]{6,7}$)/, 
    //手机号
    mobilePhone:/^(0|86|17951)?(13[0-9]|15[012356789]|17[0-9]|18[0-9]|19[0-9]|14[057]|165|166|168|199|198)[0-9]{8}$/,
}